mowglinext/mowglinext/firmware/stm32/ros_usbnode/src/ros/ros_custom/cpp_main.cpp
/**
 ******************************************************************************
 * @file    cpp_main.cpp
 * @author  Georg Swoboda <cn@warp.at>
 * @date    21/09/2022
 * @version 2.0.0
 * @brief   COBS protocol bridge — replaces rosserial with direct COBS packets
 ******************************************************************************
 *
 * Migration from rosserial to COBS:
 *   - All ROS topic publish/subscribe removed
 *   - All ROS service servers/clients removed
 *   - ros::NodeHandle replaced by mowgli_comms COBS layer
 *   - USB CDC RX feeds mowgli_comms_process_rx() instead of ringbuffer
 *   - Packet send uses mowgli_comms_send_*() convenience wrappers
 *   - cmd_vel timeout uses HAL_GetTick() instead of nh.now()
 *
 ******************************************************************************
 */

#include "adc.h"
#include "board.h"
#include "main.h"

#include "blademotor.h"
#include "charger.h"
#include "drivemotor.h"
#include "emergency.h"
#include "nbt.h"
#include "panel.h"
#include "pid.hpp"
#include "stm32f_board_hal.h"
#include "ultrasonic_sensor.h"
#include <cpp_main.h>

// USB CDC
#include "usbd_cdc_if.h"

// COBS protocol (replaces rosserial)
#include "mowgli_comms.h"
#include "mowgli_protocol.h"

// Math
#include <cmath>

// IMU
#include "imu/imu.h"

#ifdef OPTION_PERIMETER
#include "perimeter.h"
#endif

/* ---------------------------------------------------------------------------
 * Timer intervals
 * ---------------------------------------------------------------------------*/
/*
 * 10 ms (100 Hz) IMU rate. The MEMS sensor (LSM6DS33 / WT901 / LIS3MDL)
 * I2C read takes <1 ms, leaving plenty of CPU headroom in the 10 ms
 * window. At 115200 baud the additional ~50-byte IMU packet costs
 * ~4 ms wire time per second, so total serial usage stays comfortably
 * under the 11.5 KB/s budget alongside the existing 47 Hz odom and
 * 4 Hz status streams.
 */
#define IMU_NBT_TIME_MS 10
#define MOTORS_NBT_TIME_MS 20
#define STATUS_NBT_TIME_MS 250
#define PANEL_NBT_TIME_MS 100
#define LED_NBT_TIME_MS 1000
#define BLADE_NBT_TIME_MS 250

/* ---------------------------------------------------------------------------
 * Drive motor control state
 * ---------------------------------------------------------------------------*/
/* Target wheel velocities written by on_cmd_vel (ISR context) and read by
 * motors_handler() at MOTORS_NBT_TIME_MS cadence. Replaces the previous
 * "ISR writes PWM directly" path so motors_handler can run a wheel-level
 * PI loop using encoder feedback instead of forwarding an open-loop
 * cmd_vel × PWM_PER_MPS mapping. */
static volatile float left_target_mps = 0.0f;
static volatile float right_target_mps = 0.0f;

/* PWM ultimately sent to the PAC5210. Output of the PI loop in motors_handler;
 * legacy globals kept under the same names so the snapshot+watchdog logic
 * downstream is unchanged. */
static int16_t left_pwm_signed = 0;
static int16_t right_pwm_signed = 0;

/* ---------------------------------------------------------------------------
 * Wheel-level PI controller
 * ---------------------------------------------------------------------------
 * Brushed-DC motors driven by the PAC5210 have a hard static-friction
 * deadband (~PWM 40). Open-loop cmd_vel × PWM_PER_MPS produces PWM=2 for
 * a 0.05 m/s target — well below deadband, motors buzz, the chassis
 * doesn't move. We can't fix the motor physics but we CAN bridge the
 * deadband with closed-loop feedback: while the target says "move" and
 * the encoder says "stalled", the PI integrator ramps PWM up until the
 * motor breaks free, then settles around whatever PWM keeps the wheel
 * at target speed.
 *
 * Run at MOTORS_NBT_TIME_MS = 20 ms (50 Hz). Encoder feedback comes from
 * left_ticks_signed / right_ticks_signed (signed cumulative ticks
 * maintained by drivemotor.c, already direction-aware).
 *
 * Output = feedforward (target × PWM_PER_MPS, preserves the open-loop
 * behaviour above deadband) + Kp × error + integral_pwm. The integral is
 * stored pre-multiplied by Ki for trivial anti-windup.
 *
 * Set USE_WHEEL_PI to 0 to fall back to open-loop forwarding for
 * debugging / hardware bring-up. */
#define USE_WHEEL_PI 1
#define WHEEL_PI_KP_PWM_PER_MPS 30.0f /* proportional gain */
#define WHEEL_PI_KI_PWM_PER_MPS_S                                              \
  5000.0f /* integral gain (50 PWM in ~0.2 s when err=0.05 m/s) */
#define WHEEL_PI_INT_MAX_PWM                                                   \
  100.0f /* anti-windup clamp on the integral term                             \
          */
#define WHEEL_PI_DT_S (MOTORS_NBT_TIME_MS / 1000.0f)
/* Per-wheel velocity PI — battle-tested PX4 PID core (pid.hpp). Gains/limits
 * set once in init_ROS(). The integrator (kept inside the PID object) is what
 * bridges the static-friction deadband; output is the closed-loop PWM trim
 * added to the open-loop feedforward below. */
static PID left_wheel_pid;
static PID right_wheel_pid;
static int32_t prev_left_ticks_signed_pi = 0;
static int32_t prev_right_ticks_signed_pi = 0;
static float prev_left_target_mps = 0.0f;
static float prev_right_target_mps = 0.0f;

/* Open-loop feedforward velocity->PWM scale. Runtime-tunable copy of the
 * board.h PWM_PER_MPS default so the ROS 2 host can retune the drive loop via
 * PKT_ID_SET_DRIVE_PID without a reflash. Seeded with the compile-time default,
 * which therefore remains the power-on fallback (this board has no config
 * persistence; the bridge re-sends the gains on every reconnect). */
static volatile float g_pwm_per_mps = (float)PWM_PER_MPS;

/* ---------------------------------------------------------------------------
 * Gyro-local closed yaw-rate loop (Option C).
 *
 * The per-wheel PIs below regulate each wheel's SPEED independently, so the
 * chassis yaw rate was only their emergent difference — on soft/uneven turf the
 * actual yaw lagged/overshot the commanded wz (the weave). This loop closes a
 * real regulator on (commanded wz − measured gyro wz) at the 50 Hz motor
 * cadence and injects the correction as a SYMMETRIC differential velocity trim
 * (+right / −left), i.e. it rotates the robot WITHOUT changing mean forward
 * speed. Consequences of "symmetric": it never fights the host-side
 * anti-wheelspin forward-speed easing (that only scales vx), and it only shifts
 * the per-wheel PI setpoints (their deadband-bridging integrators still run).
 *
 * SAFETY: firmware stays the sole blade authority; this loop only shapes drive.
 * Fail-safe by construction — on gyro read failure, hard_stop, or disable, the
 * trim is 0 and the yaw integrator is reset, degrading to today's open-diff
 * behaviour. The trim is hard-clamped to ±g_yaw_trim_limit_mps (also the PID
 * output limit), so even a wrong gyro_sign (positive feedback) can only add a
 * bounded differential the per-wheel loops still cap at ±MAX_MPS — a bounded
 * veer, never an unbounded spin. Gains/sign/enable are runtime-tunable via
 * PKT_ID_SET_YAW_PID. */
#define YAW_PI_KP_DEFAULT 0.30f          /* m/s trim per rad/s yaw error */
#define YAW_PI_KI_DEFAULT 0.40f          /* m/s trim per (rad/s·s) */
#define YAW_TRIM_LIMIT_MPS_DEFAULT 0.15f /* clamp on |differential trim| [m/s] */
/* Integral term is clamped TIGHTER than the total trim (leaves headroom for the
 * P term and limits integral-driven overshoot/hunting). */
#define YAW_INT_LIMIT_FRAC 0.60f
/* Turn-exit anti-windup (task #37): when |commanded wz| falls from clearly
 * turning (> HI) to nearly straight (< LO) in one step, dump the integrator so
 * the wind-up built up through a U-turn doesn't drive a lingering differential
 * on the straight that follows (the reported post-U-turn wiggle). */
#define YAW_TURN_EXIT_HI_RADPS 0.40f
#define YAW_TURN_EXIT_LO_RADPS 0.15f
/* Low-speed authority scaling (task #37): below REF forward speed the yaw
 * correction (trim + a per-cycle integral leak) is scaled toward FLOOR so the
 * loop doesn't hunt on gyro noise when nearly stopped at the dock. The base
 * rotation still comes from the IK feedforward (snap targets), so an in-place
 * PRE_ROTATE pivot — commanded vx≈0 — is unaffected; only the closed-loop
 * correction is de-rated. On straights (vx ≥ REF) the scale is 1.0, so the
 * working straight-line weave rejection is untouched. */
#define YAW_LOWSPEED_REF_MPS 0.15f
#define YAW_LOWSPEED_FLOOR 0.25f
#define YAW_INT_LEAK_AT_FLOOR 0.90f /* per-cycle integral retain factor at FLOOR authority */
/* Anti-self-oscillation (task #39): the loop was self-exciting a ~2-4 Hz yaw
 * limit-cycle against the wheel deadband/stiction while the command was smooth
 * (~0.15 Hz). Two damping terms, both only REDUCE aggressiveness:
 *  - 1st-order IIR low-pass on the gyro feedback: alpha = dt / (RC + dt). At the
 *    50 Hz (dt=20 ms) motor rate, alpha=0.30 → RC≈47 ms → cutoff ≈ 3.4 Hz: it
 *    attenuates the 2-4 Hz self-oscillation the loop was chasing while adding
 *    little phase lag at the ~0.15 Hz of a real turn.
 *  - Slew-rate limit on the injected trim: caps |Δtrim| per 20 ms cycle so the
 *    output can't snap across the wheel deadband and re-excite the cycle. At
 *    0.03 m/s/cycle, full-scale (±0.15) takes ~5 cycles (100 ms) — invisible to a
 *    0.15 Hz command, fatal to a 2-4 Hz one. */
#define YAW_GYRO_LP_ALPHA 0.30f
#define YAW_TRIM_SLEW_MPS_PER_CYCLE 0.03f
static PID yaw_pid;
static float prev_yaw_trim_mps = 0.0f;
static float prev_applied_yaw_trim_mps = 0.0f; /* last trim actually injected (slew-limit state) */
static float yaw_gyro_filt = 0.0f;             /* low-passed gyro yaw rate [rad/s] */
static uint8_t yaw_gyro_filt_valid = 0u;       /* 0 until the IIR is seeded after a reset */
static float prev_cmd_wz = 0.0f;
static volatile float cmd_wz = 0.0f; /* commanded yaw rate [rad/s], set by on_cmd_vel */
static volatile uint8_t g_yaw_loop_enabled = 1;   /* default on for A/B */
static volatile float g_yaw_gyro_sign = 1.0f;     /* gyro Z sign vs robot +yaw */
static volatile float g_yaw_trim_limit_mps = YAW_TRIM_LIMIT_MPS_DEFAULT;

/* ---------------------------------------------------------------------------
 * Blade motor control state
 * ---------------------------------------------------------------------------*/
static volatile uint8_t target_blade_on_off = 0;
static uint8_t blade_on_off = 0;
static uint8_t blade_direction = 0;

/* ---------------------------------------------------------------------------
 * cmd_vel timeout tracking (replaces ros::Time)
 * ---------------------------------------------------------------------------*/
static volatile uint32_t last_cmd_vel_tick = 0;

/* ---------------------------------------------------------------------------
 * High-level state received from host
 * ---------------------------------------------------------------------------*/
static uint8_t hl_current_mode = 0;
static uint8_t hl_gps_quality = 0;

/* ---------------------------------------------------------------------------
 * Heartbeat watchdog
 * ---------------------------------------------------------------------------*/
static volatile uint32_t last_heartbeat_tick = 0;
#define HEARTBEAT_TIMEOUT_MS 2000u

/* True when the CURRENTLY latched emergency was raised SOLELY by the heartbeat
 * watchdog (host comms lost), with no physical safety sensor asserted. A pure
 * comms-loss latch is a fail-safe stop, not a physical hazard, so it is
 * auto-cleared when heartbeats resume (and no sensor is asserted) instead of
 * stranding the robot until a manual play-button / GUI reset. A physical
 * trigger (e-stop button, lift, tilt) clears this flag so its latch still
 * requires an explicit operator release. The blade stays cut throughout — it
 * only re-arms on an explicit CMD_BLADE after the emergency clears. */
static volatile bool heartbeat_only_latch = false;

/* Any physical safety sensor currently asserted? Firmware is the sole safety
 * authority; this gates every automatic emergency clear. */
static inline bool any_physical_emergency(void) {
  return Emergency_StopButtonYellow() || Emergency_StopButtonWhite() ||
         Emergency_WheelLiftBlue() || Emergency_WheelLiftRed() ||
         Emergency_Tilt() || Emergency_LowZAccelerometer();
}

/* ---------------------------------------------------------------------------
 * Reboot flag
 * ---------------------------------------------------------------------------*/
static bool reboot_flag = false;

/* ---------------------------------------------------------------------------
 * Non-blocking timers
 * ---------------------------------------------------------------------------*/
static nbt_t motors_nbt;
static nbt_t panel_nbt;
static nbt_t imu_nbt;
static nbt_t status_nbt;
static nbt_t led_nbt;
static nbt_t blade_nbt;

/* ---------------------------------------------------------------------------
 * Odometry timing
 * ---------------------------------------------------------------------------*/
static uint32_t last_odom_tick = 0;

